app/Helpers/elfin_helper.php

    function get_option($option = '', $default = '')
    {
        $db = \Config\Database::connect(); // Get the database connection
        $query = $db->table('options')->where('option', $option)->get();
---
SELECT *
FROM `options`
WHERE `option` = 'timezone'

    function get_providers_count()
    {
        $db = \Config\Database::connect(); // Get database connection
        $builder = $db->table('users'); // Load 'users' table

        $builder->where('is_delete', 0);
        $builder->where('role', 'DOCTOR');

        return $builder->countAllResults(); // Count number of matching records
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `is_delete` = 0
AND `role` = 'DOCTOR'

    function get_appointments_count($status = FALSE)
    {
        $db = \Config\Database::connect(); // Get database connection
        $builder = $db->table('appointments'); // Load 'appointments' table

        if ($status !== FALSE) {
            $builder->where('status', $status);
        }

        return $builder->countAllResults(); // Count number of matching records
---
SELECT COUNT(*) AS `numrows`
FROM `appointments`
WHERE `status` = 1

    function get_consumers_count()
    {
        $db = \Config\Database::connect(); // Get database connection
        $builder = $db->table('consumers'); // Load 'consumers' table

        return $builder->countAllResults(); // Count number of records
---
SELECT COUNT(*) AS `numrows`
FROM `consumers`

function get_inpatients_total_amt($inpid)
{
    $db = \Config\Database::connect();
    $builder = $db->table('inpatients_items');
    $builder->where('inpatients_id', $inpid);
    $query = $builder->get();
---
SELECT *
FROM `inpatients_items`
WHERE `inpatients_id` = '37'

    function get_clinic_info()
    {
        $db = \Config\Database::connect();
        $query = $db->table('clinicInfo')->get();
---
SELECT *
FROM `clinicInfo`

    function get_patient_data($pid)
    {
        $db = Database::connect();
        $query = $db->table('consumers')->where('id', $pid)->get();
---
SELECT *
FROM `consumers`
WHERE `id` = '10'

    function get_appointment_data($apid)
    {
        $db = Database::connect();
        $query = $db->table('appointments')->where('id', $apid)->get();
---
SELECT *
FROM `appointments`
WHERE `id` = '259'

function set_option($option = '', $value = '')
{
    $db = \Config\Database::connect();

    $builder = $db->table('options');

    $existing = $builder->where('option', $option)->get()->getRow();

    $data = [
        'option' => $option,
        'value' => $value,
    ];

    if ($existing) {
        $builder->where('option', $option)->update($data);
---
SELECT *
FROM `options`
WHERE `option` = 'timezone'
UPDATE `options` SET `option` = 'timezone', `value` = 'Asia/Colombo'
WHERE `option` = 'timezone'