app/Controllers/AdminController.php

public function paymentTypes()
{
    $query = $this->db->table('payment_types')
        ->where('is_delete', 0)
        ->orderBy('id', 'ASC')
        ->get();
---
SELECT *
FROM `payment_types`
WHERE `is_delete` = 0
ORDER BY `id` ASC