app/Controllers/AppointmentController.php

SELECT *
FROM `inpatients`
ORDER BY CASE WHEN pay_status = 'Pending' THEN 1 ELSE 2 END ASC, `check_in` DESC
---
    public function allinpatient()
    {
        $inpatientall = $this->db->table('inpatients')
            ->orderBy("CASE WHEN pay_status = 'Pending' THEN 1 ELSE 2 END", 'ASC')
            ->orderBy('check_in', 'DESC')
            ->get()
            ->getResult();