app/Controllers/ExpenseController.php

    public function all()
    {
        $from = $this->request->getGet('from') ?: date('d F Y');
        $to = $this->request->getGet('to') ?: date('d F Y');

        $fromDate = date('Y-m-d', strtotime($from));
        $toDate = date('Y-m-d', strtotime($to));

        $query = $this->db->table('expenses')
            ->where('expense_date >=', $fromDate)
            ->where('expense_date <=', $toDate)
            ->orderBy('id', 'DESC')
            ->get();
---
SELECT *
FROM `expenses`
WHERE `expense_date` >= '2025-04-03'
AND `expense_date` <= '2025-04-03'
ORDER BY `id` DESC