app/Controllers/ProviderController.php

    public function all($offset = 0)
    {
        $limit = 10;
        $users = $this->db->table('users')
            ->where(['role' => 'DOCTOR', 'is_delete' => 0])
            ->orderBy('first_name', 'ASC')
            ->limit($limit, $offset)
            ->get();

        $total = $this->db->table('users')->where(['role' => 'DOCTOR', 'is_delete' => 0])->countAllResults();
---
SELECT *
FROM `users`
WHERE `role` = 'DOCTOR'
AND `is_delete` = 0
ORDER BY `first_name` ASC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'DOCTOR'
AND `is_delete` = 0